{
    "nom_du_texte_1": {
        "type": "question",
        "content": "contenu de nom_du_texte_1",
        "answer_1": ["nom_texte_1", "texte de la réponse"],
        "answer_2": ["nom_texte_2", "texte de la réponse"]
    },
    "nom_du_texte_2": {
        "type": "random",
        "content": "contenu de nom_du_texte_2",
        "answer_1": ["nom_texte_1", "texte de la réponse", 0.7],
        "answer_2": ["nom_texte_2", "texte de la réponse", 0.3]
    },

    "nom_du_texte_3": {
        "type": "direct",
        "content": "contenu de nom_du_texte_3",
        "redirect": "nom_texte"
    },

    "intro": {
        "type": "question",
        "content": "Survivants d'un crash d'avion, Sarah et NOM se retrouvent échoués sur l'île Jeju en Islande. N'ayant aucune idée de l'endroit où ils se trouvaient ni de la façon de s'en sortir, ils ont cherchés un abri et ont trouvés une petite grotte isolés. C'était sombre et humide, mais c'était mieux que rien. Une fois à l'abri, les deux protagonistes commencent à préparer un feu grâce aux branches récupérées plus tôt. Pendant que Sarah s'occupe de l'allumer, NOM contemple les murs aux alentours et remarque un passage dans lequel il pourrait aisément se faufiler. Doit-il se laisser tenter par sa curiosité ou retourner avec Sarah ?",
        "answer_1": ["go_into", "Se faufiler dans le passage."],
        "answer_2": ["go_back", "Retourner aux cotés de Sarah."]
    },

    "go_into": {
        "type": "direct",
        "content": "NOM réussi, non sans difficultés, à passer à travers le passage. Devant lui se trouve un long couloir sombre au bout duquel il peut distinguer quelque chose briller légèrement. Il décide d'aller voir ce que cela pourrait bien être. Il y trouve quelques débris ressemblant étrangement à du tissu mais également une petite lampe torche endommagée ainsi qu'un couteau rouillé. Il essaye de l'allumer, sans succès, mais décide quand même de la garder avec lui. Il retourne vers Sarah.",
        "redirect": "go_back"
    },

    "go_back": {
        "type": "question",
        "content": "Pendant ce temps, Sarah avait réussi à allumer le feu. Ils vont donc pouvoir dormir au chaud cette nuit ! La nuit commence déjà à tomber et vous commencez à préparer des petits lits de fortunes avec des branches et des feuilles. Quelques minutes plus tard, vos lits sont prêts et Sarah commence déjà à s'endormir. Faut-il vous endormir à votre tour ou rester éveiller pour monter la garde ?",
        "answer_1": ["unknown", "answer 1 unknown"],
        "answer_2": ["unknown", "answer 2 unknown"]
    }
}
